zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF25 */
#define IFX_CAN_N_TX_BCF_CF25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF26 */
#define IFX_CAN_N_TX_BCF_CF26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF26 */
#define IFX_CAN_N_TX_BCF_CF26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF26 */
#define IFX_CAN_N_TX_BCF_CF26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF27 */
#define IFX_CAN_N_TX_BCF_CF27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF27 */
#define IFX_CAN_N_TX_BCF_CF27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF27 */
#define IFX_CAN_N_TX_BCF_CF27_OFF (27u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF28 */
#define IFX_CAN_N_TX_BCF_CF28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF28 */
#define IFX_CAN_N_TX_BCF_CF28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF28 */
#define IFX_CAN_N_TX_BCF_CF28_OFF (28u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF29 */
#define IFX_CAN_N_TX_BCF_CF29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF29 */
#define IFX_CAN_N_TX_BCF_CF29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF29 */
#define IFX_CAN_N_TX_BCF_CF29_OFF (29u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF30 */
#define IFX_CAN_N_TX_BCF_CF30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF30 */
#define IFX_CAN_N_TX_BCF_CF30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF30 */
#define IFX_CAN_N_TX_BCF_CF30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF31 */
#define IFX_CAN_N_TX_BCF_CF31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF31 */
#define IFX_CAN_N_TX_BCF_CF31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF31 */
#define IFX_CAN_N_TX_BCF_CF31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE0 */
#define IFX_CAN_N_TX_BTIE_TIE0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE0 */
#define IFX_CAN_N_TX_BTIE_TIE0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE0 */
#define IFX_CAN_N_TX_BTIE_TIE0_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE1 */
#define IFX_CAN_N_TX_BTIE_TIE1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE1 */
#define IFX_CAN_N_TX_BTIE_TIE1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE1 */
#define IFX_CAN_N_TX_BTIE_TIE1_OFF (1u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE2 */
#define IFX_CAN_N_TX_BTIE_TIE2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE2 */
#define IFX_CAN_N_TX_BTIE_TIE2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE2 */
#define IFX_CAN_N_TX_BTIE_TIE2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE3 */
#define IFX_CAN_N_TX_BTIE_TIE3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE3 */
#define IFX_CAN_N_TX_BTIE_TIE3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE3 */
#define IFX_CAN_N_TX_BTIE_TIE3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE4 */
#define IFX_CAN_N_TX_BTIE_TIE4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE4 */
#define IFX_CAN_N_TX_BTIE_TIE4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE4 */
#define IFX_CAN_N_TX_BTIE_TIE4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE5 */
#define IFX_CAN_N_TX_BTIE_TIE5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE5 */
#define IFX_CAN_N_TX_BTIE_TIE5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE5 */
#define IFX_CAN_N_TX_BTIE_TIE5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE6 */
#define IFX_CAN_N_TX_BTIE_TIE6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE6 */
#define IFX_CAN_N_TX_BTIE_TIE6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE6 */
#define IFX_CAN_N_TX_BTIE_TIE6_OFF (6u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE7 */
#define IFX_CAN_N_TX_BTIE_TIE7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE7 */
#define IFX_CAN_N_TX_BTIE_TIE7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE7 */
#define IFX_CAN_N_TX_BTIE_TIE7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE8 */
#define IFX_CAN_N_TX_BTIE_TIE8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE8 */
#define IFX_CAN_N_TX_BTIE_TIE8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE8 */
#define IFX_CAN_N_TX_BTIE_TIE8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE9 */
#define IFX_CAN_N_TX_BTIE_TIE9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE9 */
#define IFX_CAN_N_TX_BTIE_TIE9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE9 */
#define IFX_CAN_N_TX_BTIE_TIE9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE10 */
#define IFX_CAN_N_TX_BTIE_TIE10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE10 */
#define IFX_CAN_N_TX_BTIE_TIE10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE10 */
#define IFX_CAN_N_TX_BTIE_TIE10_OFF (10u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE11 */
#define IFX_CAN_N_TX_BTIE_TIE11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE11 */
#define IFX_CAN_N_TX_BTIE_TIE11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE11 */
#define IFX_CAN_N_TX_BTIE_TIE11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE12 */
#define IFX_CAN_N_TX_BTIE_TIE12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE12 */
#define IFX_CAN_N_TX_BTIE_TIE12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE12 */
#define IFX_CAN_N_TX_BTIE_TIE12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE13 */
#define IFX_CAN_N_TX_BTIE_TIE13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE13 */
#define IFX_CAN_N_TX_BTIE_TIE13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE13 */
#define IFX_CAN_N_TX_BTIE_TIE13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE14 */
#define IFX_CAN_N_TX_BTIE_TIE14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE14 */
#define IFX_CAN_N_TX_BTIE_TIE14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE14 */
#define IFX_CAN_N_TX_BTIE_TIE14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE15 */
#define IFX_CAN_N_TX_BTIE_TIE15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE15 */
#define IFX_CAN_N_TX_BTIE_TIE15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE15 */
#define IFX_CAN_N_TX_BTIE_TIE15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE16 */
#define IFX_CAN_N_TX_BTIE_TIE16_LEN (1u)

